<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da11_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DataFrame 합치기

* merge(join): 두 개의 DataFrame을 공통된 컬럼(들)을 기준으로 합치는 것.
* concat: DataFrame을 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [3]:
emp = pd.DataFrame({
    'empno': [100, 101, 102, 103],
    'ename': ['Scott', 'King', 'Allen', 'Tiger'],
    'deptno': [10, 20, 10, 50]
})
emp

   empno  ename  deptno
0    100  Scott      10
1    101   King      20
2    102  Allen      10
3    103  Tiger      50

In [4]:
dept = pd.DataFrame({
    'deptno': [10, 20, 30],
    'dname': ['IT', 'HR', 'Sales']
})
dept

   deptno  dname
0      10     IT
1      20     HR
2      30  Sales